Exercícios Banco de Dados
1. Crie uma tabela chamada "alunos" com os seguintes campos: id(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [ ]:
#importando
import sqlite3
import pandas as pd

In [ ]:
#conexão e criando tabela com o create table

conexao = sqlite3.connect('db_novo1')
cursor = conexao.cursor()
cursor.execute('CREATE TABLE alunos(id INT, nome TEXT, idade INT, curso TEXT);')

2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.

In [ ]:
# Inserindo dados de 5 alunos
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (1, "Alice", 20, "Matemática"),(2, "Bruno", 22, "Física"),(3, "Carla", 19, "Química"),(4, "Daniel", 21, "Biologia"),(5, "Eva", 20, "Engenharia")')

3. Consultas Básicas

Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos".

In [ ]:
#Visualizando dados da tabela:
dados = cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Alice', 20, 'Matemática')
(2, 'Bruno', 22, 'Física')
(3, 'Carla', 19, 'Química')
(4, 'Daniel', 21, 'Biologia')
(5, 'Eva', 20, 'Engenharia')

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [ ]:
#Consultando dados de nome e idade de alunos maiores de 20 anos:
dados = cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20;')
for alunos in dados:
    print(alunos)

('Bruno', 22)
('Daniel', 21)

c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.

In [ ]:
###inserindo novos alunos ao curso de Engenharia

# Inserindo dados de 3 alunos
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (6, "Fernando", 21, "Engenharia"),(7, "Gabriela", 22, "Engenharia"),(8, "Hugo", 20, "Engenharia")')

In [ ]:
#Visualizando dados atualizados:
dados = cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Alice', 20, 'Matemática')
(2, 'Bruno', 22, 'Física')
(3, 'Carla', 19, 'Química')
(4, 'Daniel', 21, 'Biologia')
(5, 'Eva', 20, 'Engenharia')
(6, 'Fernando', 21, 'Engenharia')
(7, 'Gabriela', 22, 'Engenharia')
(8, 'Hugo', 20, 'Engenharia')

In [ ]:
#consultando alunos do curso de "Engenharia" em ordem alfabética
dados = cursor.execute('SELECT * FROM alunos WHERE curso ="Engenharia" ORDER BY nome')
for alunos in dados:
    print(alunos)

(5, 'Eva', 20, 'Engenharia')
(6, 'Fernando', 21, 'Engenharia')
(7, 'Gabriela', 22, 'Engenharia')
(8, 'Hugo', 20, 'Engenharia')

d) Contar o número total de alunos na tabela

In [ ]:
# Contando o número total de alunos
dados = cursor.execute('SELECT COUNT(*) FROM alunos')
for alunos in dados:
    print(alunos)

(8,)

4. Atualização e Remoção

a) Atualize a idade de um aluno específico na tabela.

In [ ]:
#Atualizando idade de Gabriela id=7 de 22 para 23 anos
cursor.execute('UPDATE alunos SET idade = 23 WHERE id=7')

In [ ]:
#Visualizando dados atualizados:
dados = cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Alice', 20, 'Matemática')
(2, 'Bruno', 22, 'Física')
(3, 'Carla', 19, 'Química')
(4, 'Daniel', 21, 'Biologia')
(5, 'Eva', 20, 'Engenharia')
(6, 'Fernando', 21, 'Engenharia')
(7, 'Gabriela', 23, 'Engenharia')
(8, 'Hugo', 20, 'Engenharia')

b) Remova um aluno pelo seu ID.

In [ ]:
#Deletando aluno Carla pelo ID
cursor.execute('DELETE FROM alunos WHERE id=3')

In [ ]:
#Visualizando dados atualizados:
dados = cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Alice', 20, 'Matemática')
(2, 'Bruno', 22, 'Física')
(4, 'Daniel', 21, 'Biologia')
(5, 'Eva', 20, 'Engenharia')
(6, 'Fernando', 21, 'Engenharia')
(7, 'Gabriela', 23, 'Engenharia')
(8, 'Hugo', 20, 'Engenharia')

5. Criar uma Tabela e Inserir Dados

Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns
registros de clientes na tabela.

In [ ]:
conexao = sqlite3.connect('db_novo2')
cursor = conexao.cursor()

#Criando tabela "Clientes"
cursor.execute('CREATE TABLE clientes (id INTEGER PRIMARY KEY, nome TEXT, idade INT, saldo FLOAT)')

In [ ]:
#Inserindo dados na tabela
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (1, "Alice", 30, 1500.75),(2, "Bruno", 25, 2000.00),(3, "Carla", 28, 2500.50),(4, "Daniel", 35, 1800.25)')

In [ ]:
#Visualizando dados da tabela:
dados = cursor.execute('SELECT * FROM clientes')
for clientes in dados:
    print(clientes)

(1, 'Alice', 30, 1500.75)
(2, 'Bruno', 25, 2000.0)
(3, 'Carla', 28, 2500.5)
(4, 'Daniel', 35, 1800.25)

6. Consultas e Funções Agregadas

Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a 30 anos

In [ ]:
#Selecionando nome e idade de clientes maiores de 30 anos:

dados = cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')
for clientes in dados:
    print(clientes)

('Daniel', 35)

b) Calcule o saldo médio dos clientes

In [ ]:
#Calculando a média do saldo dos clientes:
dados = cursor.execute('SELECT AVG(saldo) FROM clientes')
for clientes in dados:
    print(clientes)

(1950.375,)

c) Encontre o cliente com o saldo máximo.

In [ ]:
#retornar clientes quando saldo = Selecionar saldo Máximo de clientes
dados = cursor.execute('SELECT * FROM clientes WHERE saldo = (SELECT MAX(saldo) FROM clientes)')
for clientes in dados:
    print(clientes)

(3, 'Carla', 28, 2500.5)

d) Conte quantos clientes têm saldo acima de 1000.

In [ ]:
#Editando cliente id = 1 para  saldo < 1000

cursor.execute('UPDATE clientes SET saldo = 800.00 WHERE id = 1;')

In [ ]:
#Visualizando dados da tabela:
dados = cursor.execute('SELECT * FROM clientes')
for clientes in dados:
    print(clientes)

(1, 'Alice', 30, 800.0)
(2, 'Bruno', 25, 2000.0)
(3, 'Carla', 28, 2500.5)
(4, 'Daniel', 35, 1800.25)

In [ ]:
#Contando número de clientes com saldo > 1000
dados = cursor.execute('SELECT COUNT(*) FROM clientes WHERE saldo > 1000;')
for clientes in dados:
    print(clientes)

(3,)

7. Atualização e Remoção com Condições

a) Atualize o saldo de um cliente específico.

In [ ]:
#Editando cliente id = 1 para o saldo anterior:

cursor.execute('UPDATE clientes SET saldo = 1500.75 WHERE id = 1;')

In [ ]:
#Visualizando dados da tabela:
dados = cursor.execute('SELECT * FROM clientes')
for clientes in dados:
    print(clientes)

(1, 'Alice', 30, 1500.75)
(2, 'Bruno', 25, 2000.0)
(3, 'Carla', 28, 2500.5)
(4, 'Daniel', 35, 1800.25)

b) Remova um cliente pelo seu ID.

In [ ]:
#Deletando cliente id=4

cursor.execute('DELETE FROM clientes WHERE id=4')

In [ ]:
#Visualizando dados atualizados:

dados = cursor.execute('SELECT * FROM clientes')
for clientes in dados:
    print(clientes)

(1, 'Alice', 30, 1500.75)
(2, 'Bruno', 25, 2000.0)
(3, 'Carla', 28, 2500.5)

8. Junção de Tabelas

Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real). Insira algumas compras associadas a clientes existentes na tabela "clientes". Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

In [ ]:
#Criando tabela compras:
cursor.execute('CREATE TABLE compras (id INTEGER PRIMARY KEY,cliente_id INTEGER, produto TEXT, valor REAL, FOREIGN KEY (cliente_id) REFERENCES clientes(id))')

In [ ]:
#Inserindo dados na tabela compras:

cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (1, 1, "Notebook", 1200.00), (2, 2, "Smartphone", 800.00),(3, 3, "Fone de Ouvido", 150.00),(4, 4, "Cadeira Gamer", 600.00),(5, 1, "Teclado Mecânico", 300.00)')

In [ ]:
#Visualizar dados da tabela:

dados = cursor.execute('SELECT * FROM compras')
for compras in dados:
    print(compras)

(1, 1, 'Notebook', 1200.0)
(2, 2, 'Smartphone', 800.0)
(3, 3, 'Fone de Ouvido', 150.0)
(4, 4, 'Cadeira Gamer', 600.0)
(5, 1, 'Teclado Mecânico', 300.0)

In [ ]:
#Trazendo dados de nome, produto e valor das tabelas clientes e compras:
dados = cursor.execute('SELECT c.nome, co.produto, co.valor FROM clientes c JOIN compras co ON c.id = co.cliente_id;')
for clientes in dados:
    print(clientes)

('Alice', 'Notebook', 1200.0)
('Bruno', 'Smartphone', 800.0)
('Carla', 'Fone de Ouvido', 150.0)
('Alice', 'Teclado Mecânico', 300.0)